software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/InsertDistributionProtocol.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <InsertRequest xmlns="http://wapi.wustl.edu/WAPI">
            <object>
                <ns1:AbstractDomainObject
                        activityStatus="Active"
                        identifier="0"
                        shortTitle="Some Title-101"
                        startDate="2011-08-04T20:19:50.364Z"
                        title="Some Title 101"
                        xsi:type="ns2:DistributionProtocol"
                        xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws"
                        xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">
                    <ns2:principalInvestigator>
                        <ns2:User csmUserId="0" dirtyEditFlag="false" firstTimeLogin="false" identifier="1" remoteId="0"
                                  remoteManagedFlag="false"/>
                    </ns2:principalInvestigator>
                </ns1:AbstractDomainObject>
            </object>
        </InsertRequest>
    </soapenv:Body>
</soapenv:Envelope>